We can create 10 `Person` nodes every second by running the following query:

[source,cypher]
----
CALL apoc.periodic.repeat(
  "create-people",
  "UNWIND range(1,10) AS id CREATE (:Person {uuid: apoc.create.uuid()})",
   1
);
----

.Results
[opts="header"]
|===
| name            | delay | rate | done  | cancelled
| "create-people" | 0     | 1    | FALSE | FALSE
|===

We can check how many nodes have been created by running the following query:

[source,cypher]
----
MATCH (:Person)
RETURN count(*) AS count;
----

.Results
[opts="header"]
|===
| count
| 110
|===

We can also configure a retry number for every execution:

[source,cypher]
----
CALL apoc.periodic.repeat("create-people", "QUERY_WHICH_CAN_FAIL", 1, {retries: 5});
----

Moreover, we can pass a `tolerateErrors`, to continue the execution in case of failed query, without interrupt the procedure.

[source,cypher]
----
CALL apoc.periodic.repeat("create-people", "QUERY_WHICH_CAN_FAIL", 1, {tolerateErrors: true});
----


If we want to cancel this job, we can use the xref::overview/apoc.periodic/apoc.periodic.cancel.adoc[] procedure.